"""
运算符+字符串格式化
"""

# 算术运算符
print("1+1=", 1+1)
print("2-1=", 2-1)
print("2*3=", 2*3)
print("6/2=", 6/2)  
print("6//2=", 6//2) # 取整除，返回商的整数部分
print("5%2=", 5%2)  # 取余数
print("2**2=", 2**2)  # 幂运算

# 赋值运算符
# 1.标准赋值
# = 把右边的值赋给左边的变量
num = 1 + 2 * 3
print("num =", num)
# 2.复合赋值运算符
# += （c+=a等效于c=c+a）{[-= /= %= *= //= **=]类比+=}
num = 1
num += 1
print("num =", num)

# 字符串的三种定义方式
# 1.单引号定义字符串
name = '黑马程序员'
print(type(name))
# 2.双引号定义字符串
name = "黑马程序员"
print(type(name))
# 3.三引号定义字符串
name = '''黑马程序员'''
print(type(name)) 

# 字符串引号的嵌套
# 1.单引号定义的字符串中嵌套双引号
name = '"黑马程序员"'
# 2.双引号定义的字符串中嵌套单引号
name = "'黑马程序员'"
# 3.使用转义字符\解除引号的效用
name = "\"黑马程序员"
print(name)

# 字符串拼接（+）只适用于字符串本身，不适用数字
# 1.字面量之间的拼接
print("学IT来黑马程序员"+"月入过万")
# 2.字符串字面量和字符串变量的拼接
name = "吕永恒"
address = "山东省" 
# 字符串无法通过加号与数字进行拼接 （输入tel = 314520会报错）
print("我叫："+ name , "住在：" + address)

# 字符串格式化
# 字符串拼接缺点：变量过多拼接麻烦，字符串无法和数字或其他类型进行拼接->字符串格式化
# 通过占位的形式，完成字符串与数字的拼接
# 1.%s:将将内容转换成字符串，放入占位位置
name = "吕永恒"
address = "山东省" 
tel = 314520
message = "我叫%s, 住在%s, 电话号码是%s" %(name,address,tel)
print(message)
# 2.%d:将内容转换成整数，放入占位位置
#   %f:将内容转换成浮点数，放入占位位置
name = "吕永恒"
address = "山东省" 
tel = 314520
cash = 1.1
message = "我叫%s, 住在%s, 电话号码是%d, 昨天买了特价橘子花了%f元" %(name,address,tel,cash)
print(message)

# 数字精度控制
# "m.n" m控制宽度，设置的宽度小于数字自身，不生效 n控制小数点精度，会进行四舍五入
num1 = 66
print("宽度限制4,输出: %4d" % num1)
num2 = 13.145
print("宽度限制7,小数精度限制2,输出: %7.2f" % num2)
num3 = 13.45
print("不限制宽度,精度控制为1,输出：%.1f"%num3)

# 字符串格式化2
# f"{变量},{变量},{变量}"(更高效)
name = "深度求索"
set_up_year = 2023
stock_price = 99.9
print(f"{name}成立于{set_up_year},现在的股票价格是{stock_price}")

# 对表达式进行格式化
print("1 + 1的结果是: %d" % (1 + 1))
print(f"1 * 2的结果是:{1 * 2}")
print("字符串在python中的类型名是: %s" % type("字符串"))

# input()
# 1.输出括号内的内容并获取键盘输入的数据
# 2.无论键盘输入什么样类型的数据，获得的数据类型永远是字符串类型
name = input("请告诉我你是谁")
# print(f"我知道了你是:{name}")
print("I see,you're %s" %name)