"""字符串"""
# 方法
"""
编号  操作                        说明
1   字符串.[下标］            根据下标索引取出特定位置字符
2   字符串.index（字符串）     查找给定字符的第一个匹配项的下标

3   字符串.replace（字符串1，字符串2）将字符串内的全部字符串1，替换为字符串2,不会修改原字符串，而是得到一个新的
4   字符串.split（字符串）    按照给定字符串，对字符串进行分隔,不会修改原字符串，而是得到一个新的
字符串.strip（）
5   字符串.strip（）         移除首尾的空格和换行符或指定字符串
    字符串.strip（字符串）
6   字符串.count（字符串）    统计字符串内某字符串的出现次数
7   len（字符串）            统计字符串的字符个数
"""
# 字符串的遍历
# while遍历
my_str = "lv yong heng"
index = 0
while index < len(my_str):
    print(f"字符串遍历后是{my_str[index]}")
    index += 1