"""
定义一个函数，函数名任意，要求调用函数后可以输出如下欢迎语：
欢迎来到黑马程序员！
请出示您的健康码以及72小时核酸证明！
"""
# def 欢迎():
#     print("欢迎来到黑马程序员！\n请出示您的健康码以及72小时核酸证明！")
# 欢迎()

"""
定义一个函数，名称任意，并接受一个参数传入（数字类型，表示体温）
在函数内进行体温判断（正常范围：小于等于37.5度），并输出如下内容：
欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！
体温测量中，您的体温是：37.3度，体温正常请进！
欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！
体温测量中，您的体温是：39.3度，需要隔离！
"""
# def wendu(x):
#     if x <= 37.5:
#         print(f"欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！\n体温测量中，您的体温是{x}度，体温正常请进！")
#     else:
#         print(f"欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并哦诶和测量体温！\n体温测量中，您的体温是{x}度，需要隔离！")
# wendu(39.9)

"""
• 定义一个全局变量：money，用来记录银行卡余额（默认5000000）
• 定义一个全局变量：name，用来记录客户姓名（启动程序时输入）
• 定义如下的函数：
• 查询余额函数
• 存款函数
• 取款函数
• 主菜单函数
• 要求：
• 程序启动后要求输入客户姓名
• 查询余额、存款、取款后都会返回主菜单
• 存款、取款后，都应显示一下当前余额
• 客户选择退出或输入错误，程序会退出，否则一直运行
"""
money = 5000000
name = input("请输入姓名：")
def main_menu():
    print("主菜单“\f”欢迎来到永亨银行ATM，请选择操作：",end = '')
def cash_balance():
    print(f"您的银行帐户余额为{money}")
def cash_deposit():
    cash1 = int(input("请输入你要存钱的数目："))
    print(f"当前账户剩余余额为{money + cash1}元")
def cash_withdraw():
    cash2 = int(input("请输入你要取的数目："))
    print(f"当前账户余额为{money - cash2}元")
main_menu()
cash_balance()
cash_deposit()