"""
定义一个函数，函数名任意，要求调用函数后可以输出如下欢迎语：
欢迎来到黑马程序员！
请出示您的健康码以及72小时核酸证明！
"""
def 欢迎():
    print("欢迎来到黑马程序员！\n请出示您的健康码以及72小时核酸证明！")
欢迎()

"""
定义一个函数，名称任意，并接受一个参数传入（数字类型，表示体温）
在函数内进行体温判断（正常范围：小于等于37.5度），并输出如下内容：
欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！
体温测量中，您的体温是：37.3度，体温正常请进！
欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！
体温测量中，您的体温是：39.3度，需要隔离！
"""
def wendu(x):
    if x <= 37.5:
        print(f"欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并配合测量体温！\n体温测量中，您的体温是{x}度，体温正常请进！")
    else:
        print(f"欢迎来到黑马程序员！请出示您的健康码以及72小时核酸证明，并哦诶和测量体温！\n体温测量中，您的体温是{x}度，需要隔离！")
wendu(39.9)